/*
* .__         ___.                    __         .__       .__    .__
* |  |__  __ _\  |__   ____   ____   |  | ______ |  | _____|  |__ |  |
* |  |  \|  |  \ __ \_/ __ \ /    \  |  |/ /  _ \|  |/  ___/  |  \|  |
* |   Y  \  |  / \_\ \  ___/|   |  \ |    <  <_> )  |\___ \|   Y  \  |
* |___|  /____/|___  /\____> ___|  / |__|  \____/|__/______>___|  /__|
*      \/          \/            \/      \/                     \/
*/
"use strict";

// 修饰符
//   i 不区分大小写
//   g 匹配所有而非第一个
//   m 多行模式
//   u 开启完整 Unicode 支持
//   y 粘滞模式

let str1 = "I love JavaScript";

console.log(str1.search(/Love/));  // -1 代表没找到
console.log(str1.search(/Love/i)); // 2